### Dataset con informacion financiera, gastos y entradas de personas de distinto sexo y distritos o barrios o sectores de una ciudad, estas ultimas son variables categoricas

In [29]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [30]:
df = pd.read_csv("../datasets/ecom-expense/Ecom Expense.csv")

In [31]:
df.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [32]:
#creamos un dummy para las variables categoricas, con esto se asignan variables numericas a cada categoria
dummy_gender = pd.get_dummies(df["Gender"],prefix ="Gender")
dummy_city_tier = pd.get_dummies(df["City Tier"],prefix ="City")

In [33]:
#quedan 2 columnas para la variable categorica Gender
dummy_gender.head()

   Gender_Female  Gender_Male
0              1            0
1              1            0
2              0            1
3              1            0
4              1            0

In [34]:
#quedan 3 columnas para la variable categorica City Tier
dummy_city_tier.head()

   City_Tier 1  City_Tier 2  City_Tier 3
0            1            0            0
1            0            1            0
2            0            1            0
3            1            0            0
4            0            1            0

In [44]:
#Se unen estas variables dummy al dataframe principal con JOIN
column_names = df.columns.values.tolist() #se crea una lista con los nombres de columnas del df principal
column_names

['Transaction ID',
 'Age ',
 ' Items ',
 'Monthly Income',
 'Transaction Time',
 'Record',
 'Gender',
 'City Tier',
 'Total Spend']

In [45]:
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0

In [46]:
df_new = df_new[column_names].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0

In [52]:
#ahora ver como incluimos las variables dummy en el modelo lineal que buscamos crear para predecir el gasto total
feature_cols = ["Monthly Income","Transaction Time",
                "Gender_Female","Gender_Male",
                "City_Tier 1","City_Tier 2","City_Tier 3",
               "Record"]

In [53]:
#variables a usar como predictores
X = df_new[feature_cols]
#variable Y que se quiere predecir
Y = df_new["Total Spend"]

In [54]:
#ahora se crea el modelo lineal con sklearn
lm = LinearRegression()
lm.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [55]:
print(lm.intercept_)
print(lm.coef_)

3655.7294076906537
[   0.15297825    0.12372609  -94.15779883   94.15779883  119.6632516
  -16.67901801 -102.9842336 ]

In [57]:
#se unen las columnas con con sus respectivos coeficientes
list(zip(feature_cols,lm.coef_))

[('Monthly Income', 0.15297824609320512),
 ('Transaction Time', 0.1237260864262),
 ('Gender_Female', -94.15779883032016),
 ('Gender_Male', 94.15779883032022),
 ('City_Tier 1', 119.66325160390089),
 ('City_Tier 2', -16.679018007990205),
 ('City_Tier 3', -102.98423359591068)]

In [58]:
lm.score(X,Y) #R2 sale bajo, hay que refinar el modelo, agregaremos la variable Record

0.19478920552885381